#+TITLE: Continuous Integration and TeX with Org-mode
#+SUBTITLE:  TeX in the cloud
#+AUTHOR: Rohit Goswami,\textsc{\scriptsize\ MInstP}
#+EMAIL:  rog32@hi.is
#+DATE:   \today

** A block :B_ignoreheading:BMCOL:
:PROPERTIES:
:BEAMER_col: 0.6
:END:

#+begin_src latex :exports code
\documentclass{article}
\author{John Doe}
\title{Astounding Discoveries}
\begin{document}
\maketitle
\section{TeX}
Hello World
\end{document}
#+end_src

#+RESULTS:
#+begin_export latex
\documentclass{article}
\author{John Doe}
\title{Astounding Discoveries}
\begin{document}
\maketitle
\section{TeX}
Hello World
\end{document}
#+end_export

* Polluted Outputs

#+begin_src bash :exports both
wc -l {base,orgOne,pandocOne}.tex
#+end_src

#+RESULTS:
|  8 | base.tex      |
| 15 | orgOne.tex    |
| 63 | pandocOne.tex |

- Generated files involve _template substitution_
